<a href="https://colab.research.google.com/github/benjipeng/Colab-Projects/blob/main/SQLite_in_Colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
!pip install ipython-sql # Not needed for Colab ðŸ˜† Thanks Google

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.29)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.10.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 1.6/1.6 MB 13.3 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///test.db

In [14]:
%%sql
create table sample(column_1 int, column_2 varchar);
insert into sample values (1,'abc'),(2,'abcd');
select * from sample;

 * sqlite:///test.db
(sqlite3.OperationalError) table sample already exists
[SQL: create table sample(column_1 int, column_2 varchar);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [16]:
%%sql
DROP TABLE IF EXISTS driver;
DROP TABLE IF EXISTS city;
DROP TABLE IF EXISTS daily_ride;

 * sqlite:///test.db
Done.
Done.
Done.

[]

In [17]:
%%sql
-- drop table if exists city
create table city(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name varchar(30) not null,
    country_code varchar(5)
);

insert into city (name, country_code) values ('Fanhu', 'USA');
insert into city (name, country_code) values ('Goodlands', 'USA');
insert into city (name, country_code) values ('Furong', 'USA');
insert into city (name, country_code) values ('Guxian', 'JPN');
insert into city (name, country_code) values ('Ar Rahad', 'OMN');
insert into city (name, country_code) values ('Uitenhage', 'USA');
insert into city (name, country_code) values ('Yanglinshi', 'JPN');
insert into city (name, country_code) values ('Mengjia', 'JPN');

-- drop table if exists driver
create table driver(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name varchar(20),
    last_name varchar(20),
    vehicle_id int,
    city_id int
);

insert into driver (first_name, last_name, vehicle_id, city_id) values ('Cicely', 'Heaker', 1, 5);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Brandy', 'Rizzone', 2, 2);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Hewitt', 'Foden', 3, 2);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Freddie', 'Rohfsen', 4, 8);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Johann', 'McRill', 5, 1);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Arabella', 'MacKeague', 6, 4);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Jonie', 'Greenan', 7, 8);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Alysa', 'Hanselman', 8, 2);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Vale', 'Heathwood', 9, 1);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Kennedy', 'Headon', 10, 7);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Ugo', 'Rapper', 11, 1);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Laverna', 'Harkin', 12, 3);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Washington', 'Kingdon', 13, 8);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Rogers', 'Ferronet', 14, 7);
insert into driver (first_name, last_name, vehicle_id, city_id) values ('Raleigh', 'Norgan', 15, 5);

-- drop table if exists daily_ride
create table daily_ride(
    date date,
    driver_id int,
    amount_earned decimal(6,2),
    ride_distance decimal(5,2)
);

insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-11', 8, 198.41, 29.67);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-09', 10, 65.82, 23.39);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-03', 8, 187.77, 5.77);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-28', 13, 273.41, 41.34);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-02', 9, 102.92, 94.51);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-02', 1, 74.85, 38.8);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-06', 4, 312.21, 70.7);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-19', 1, 148.68, 59.91);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-21', 14, 167.77, 35.76);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-24', 9, 223.94, 7.49);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-16', 9, 5.88, 6.5);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-19', 13, 38.31, 25.31);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-24', 4, 33.94, 71.32);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-14', 13, 71.26, 94.04);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-23', 8, 152.09, 1.5);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-06', 6, 206.48, 8.88);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-20', 7, 261.01, 97.81);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-03', 1, 119.72, 6.63);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-13', 10, 77.95, 8.86);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-06', 14, 102.9, 36.22);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-17', 7, 263.06, 63.85);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-05', 6, 125.6, 83.41);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-18', 1, 80.19, 81.05);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-18', 13, 349.35, 60.93);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-18', 3, 230.82, 35.77);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-31', 11, 156.39, 4.28);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-03', 10, 376.38, 72.98);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-05', 7, 114.81, 14.06);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-23', 1, 11.3, 75.65);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-21', 5, 398.57, 11.91);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-28', 9, 178.44, 66.02);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-22', 13, 266.44, 12.16);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-27', 13, 382.47, 37.16);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-28', 13, 327.74, 79.3);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-14', 3, 74.7, 26.2);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-03', 9, 157.97, 36.15);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-22', 13, 212.57, 23.22);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-13', 1, 301.57, 36.76);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-30', 5, 31.8, 73.93);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-12', 3, 396.49, 30.46);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-21', 2, 222.17, 57.34);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-12', 3, 363.4, 41.21);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-12', 9, 227.96, 11.48);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-21', 5, 77.59, 71.0);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-14', 8, 275.88, 97.34);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-16', 5, 365.88, 96.7);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-14', 4, 271.33, 59.66);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-18', 3, 383.73, 79.69);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-08', 6, 245.05, 79.13);
insert into daily_ride (date, driver_id, amount_earned, ride_distance) values ('2021-03-14', 6, 328.01, 91.68);

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

/content

In [18]:
%%sql
select *  from city

 * sqlite:///test.db
Done.

[(1, 'Fanhu', 'USA'),
 (2, 'Goodlands', 'USA'),
 (3, 'Furong', 'USA'),
 (4, 'Guxian', 'JPN'),
 (5, 'Ar Rahad', 'OMN'),
 (6, 'Uitenhage', 'USA'),
 (7, 'Yanglinshi', 'JPN'),
 (8, 'Mengjia', 'JPN')]

In [19]:
%%sql
select * from driver

 * sqlite:///test.db
Done.

[(1, 'Cicely', 'Heaker', 1, 5),
 (2, 'Brandy', 'Rizzone', 2, 2),
 (3, 'Hewitt', 'Foden', 3, 2),
 (4, 'Freddie', 'Rohfsen', 4, 8),
 (5, 'Johann', 'McRill', 5, 1),
 (6, 'Arabella', 'MacKeague', 6, 4),
 (7, 'Jonie', 'Greenan', 7, 8),
 (8, 'Alysa', 'Hanselman', 8, 2),
 (9, 'Vale', 'Heathwood', 9, 1),
 (10, 'Kennedy', 'Headon', 10, 7),
 (11, 'Ugo', 'Rapper', 11, 1),
 (12, 'Laverna', 'Harkin', 12, 3),
 (13, 'Washington', 'Kingdon', 13, 8),
 (14, 'Rogers', 'Ferronet', 14, 7),
 (15, 'Raleigh', 'Norgan', 15, 5)]

In [20]:
%%sql
select * from daily_ride limit 10

 * sqlite:///test.db
Done.

[('2021-03-11', 8, 198.41, 29.67),
 ('2021-03-09', 10, 65.82, 23.39),
 ('2021-03-03', 8, 187.77, 5.77),
 ('2021-03-28', 13, 273.41, 41.34),
 ('2021-03-02', 9, 102.92, 94.51),
 ('2021-03-02', 1, 74.85, 38.8),
 ('2021-03-06', 4, 312.21, 70.7),
 ('2021-03-19', 1, 148.68, 59.91),
 ('2021-03-21', 14, 167.77, 35.76),
 ('2021-03-24', 9, 223.94, 7.49)]

In [21]:
%%sql
with total_distance_ride as (
    select
        sum(r.ride_distance) as total_distance,
        r.driver_id,
        d.city_id
    from daily_ride r
    join driver d
        on r.driver_id = d.id
    join city c
        on d.city_id = c.id
    group by r.driver_id, d.city_id
), max_ride_distance as (
    select
        max(total_distance) as max_distance,
        city_id
    from total_distance_ride
    group by city_id
)

select avg(max_distance) as avg_max_distance, city_id from max_ride_distance group by city_id

 * sqlite:///test.db
Done.

[(253.54000000000002, 1),
 (213.33, 2),
 (263.1, 4),
 (298.79999999999995, 5),
 (105.23, 7),
 (373.46000000000004, 8)]

In [22]:
%%sql
with max_amount_earned as (
    select
    max(r.amount_earned) as max_earned,
    r.date,
    d.city_id
    from daily_ride r
    join driver d
        on r.driver_id = d.id
    join city c
        on d.city_id = c.id
    group by r.date, d.city_id
), average_maximal_amount as (
    select
        avg(max_earned) as day_average,
        date
    from max_amount_earned
    group by date
)

select count(date) as number_of_days from average_maximal_amount where day_average > 50;

 * sqlite:///test.db
Done.

[(22,)]